//Задайте строку, содержащую латинские буквы в обоих регистрах. 
//Сформируйте строку, в которой все заглавные буквы заменены на строчные.

string Stroka = "ASdfasASdasda";
string result = Stroka.ToLower();
System.Console.WriteLine(result);